app/controllers/api/v1/drivers/drivers_controller.rb

  def driver_list
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def update_profile
    if @driver.update_attributes(update_params)
---
UPDATE "drivers" SET "first_name" = ?, "last_name" = ?, "mobile_number" = ?, "updated_at" = ? WHERE "drivers"."id" = 12  [["first_name", "aedfa"], ["last_name", "adsvd"], ["mobile_number", 1423467955], ["updated_at", "2014-10-16 07:54:14.430004"]]