app/controllers/api/v1/drivers/sessions_controller.rb

INSERT INTO "drivers" ("created_at", "device_id", "device_type", "email", "encrypted_password", "first_name", "last_name", "mobile_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "driver_authentication_tokens" ("auth_token", "created_at", "driver_id", "updated_at") VALUES (?, ?, ?, ?)  [["auth_token", "f7f74a64afbff1e7839942ddb033cc54"], ["created_at", "2014-10-17 10:36:06.369037"], ["driver_id", 4], ["updated_at", "2014-10-17 10:36:06.369037"]]
---
  def driver_register
    @driver = Driver.new(drivers_params)
    if @driver.save
      @token_driver = @driver.driver_authentication_tokens.build
      @token_driver.save

SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."email" = 'p@gmail.com' LIMIT 1
INSERT INTO "driver_authentication_tokens" ("auth_token", "created_at", "driver_id", "updated_at") VALUES (?, ?, ?, ?)  [["auth_token", "d136ecdd5743c06a1ecbcaa2baf16932"], ["created_at", "2014-10-17 10:36:24.444613"], ["driver_id", 4], ["updated_at", "2014-10-17 10:36:24.444613"]]
---
  def driver_login
    @valid_email = params[:email].present?
    @valid_password = params[:password].present?
    @driver = Driver.authenticate_driver_with_auth_token(params[:email],params[:password])
    if @driver.present?
      @token_driver = @driver.driver_authentication_tokens.build
      @token_driver.save

SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."email" = 'l@gmail.com' LIMIT 1
---
  def driver_forgot_password
  if params[:email].present?
    @driver = Driver.find_by(email: params[:email])

UPDATE "drivers" SET "encrypted_password" = ?, "updated_at" = ? WHERE "drivers"."id" = 1  [["encrypted_password", "$2a$10$6diHRo.PUwrm.XHDlEXeJ.FmnKeV488hcbL2DC4mukMuY7HHF2EQm"], ["updated_at", "2014-10-17 12:24:16.248461"]]
---
  def driver_change_password
    if params[:driver][:current_password].present? && params[:driver][:password].present?
      if @driver.update_with_password(driver_change_password_params)