app/controllers/api/v1/drivers/sessions_controller.rb

  def sing_up
    @driver = Driver.new(drivers_params)
    if @driver.save
      @token = @driver.driver_authentication_tokens.build
      @token.save
---
INSERT INTO "drivers" ("created_at", "device_id", "device_type", "email", "encrypted_password", "first_name", "last_name", "mobile_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "driver_authentication_tokens" ("created_at", "driver_auth_token", "driver_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-16 07:28:00.929552"], ["driver_auth_token", "369dfbd97cfa22c7ee3ed639a6d7fca7"], ["driver_id", 6], ["updated_at", "2014-10-16 07:28:00.929552"]]

  def sing_in
    @valid_email = params[:email].present?
    @valid_password = params[:password].present?
    @driver = Driver.authenticate_driver_with_auth_token(params[:email],params[:password])
    if @driver.present?
      @token = @driver.driver_authentication_tokens.build
      @token.save
---
SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."email" = 'm123@gmail.com' LIMIT 1
INSERT INTO "driver_authentication_tokens" ("auth_token", "created_at", "driver_id", "updated_at") VALUES (?, ?, ?, ?)  [["auth_token", "b16d83ad4027fbccb433e7734e205386"], ["created_at", "2014-10-17 07:01:20.042258"], ["driver_id", 1], ["updated_at", "2014-10-17 07:01:20.042258"]]

  def forgot_password
  if params[:email].present?
    @driver = Driver.find_by(email: params[:email])
---
SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."email" = 'pooja@gmail.com' LIMIT 1

  def change_password
    if params[:driver][:current_password].present? && params[:driver][:password].present?
      if @driver.update_with_password(change_password_params)
---
UPDATE "drivers" SET "encrypted_password" = ?, "updated_at" = ? WHERE "drivers"."id" = 7  [["encrypted_password", "$2a$10$yd7wnnbdKK.NfBryg4H/Y.AqOCrzCK8Y3FIIc4vN3ynou3V7hQTPC"], ["updated_at", "2014-10-16 07:37:27.841877"]]