app/controllers/api/v1/cars_controller.rb

  def create_car
    @car = Car.create(car_params)
    if @car.save
---
INSERT INTO "cars" ("created_at", "name", "total_luggage", "total_passenger", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-14 09:44:14.850516"], ["name", "heloo"], ["total_luggage", "12 kg"], ["total_passenger", 12.0], ["updated_at", "2014-10-14 09:44:14.850516"]]
UPDATE "cars" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "cars"."id" = 23

  def car_list
    @cars = Car.all
---
SELECT "cars".* FROM "cars"