app/controllers/api/v1/sessions_controller.rb

INSERT INTO "users" ("created_at", "device_id", "device_type", "email", "encrypted_password", "first_name", "last_name", "mobile_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "authentication_tokens" ("auth_token", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["auth_token", "6fcc32af64f45793607faef87d1144f6"], ["created_at", "2014-10-17 10:33:38.167652"], ["updated_at", "2014-10-17 10:33:38.167652"], ["user_id", 2]]
---
  def register
    @user = User.new(users_params)
    if @user.save
      @token = @user.authentication_tokens.build
      @token.save

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'pinky@gmail.com' LIMIT 1
INSERT INTO "authentication_tokens" ("auth_token", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["auth_token", "7ef1dc35d845610cc63a6129e672af6a"], ["created_at", "2014-10-17 10:34:09.720401"], ["updated_at", "2014-10-17 10:34:09.720401"], ["user_id", 2]]
---
  def login
    @valid_email = params[:email].present?
    @valid_password = params[:password].present?
    @user = User.authenticate_user_with_auth_token(params[:email],params[:password])
    if @user.present?
      @token = @user.authentication_tokens.build
      @token.save