app/controllers/api/v1/sessions_controller.rb

INSERT INTO "users" ("created_at", "device_id", "device_type", "email", "encrypted_password", "first_name", "last_name", "mobile_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "authentication_tokens" ("auth_token", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["auth_token", "1ba5544841fabaaafc59e28673e5fee9"], ["created_at", "2014-10-13 10:55:20.081858"], ["updated_at", "2014-10-13 10:55:20.081858"], ["user_id", 2]]
---
  def sing_up
    @user = User.new(users_params)
    if @user.save
      @token = @user.authentication_tokens.build
      @token.save

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'pooja12@gmail.com' LIMIT 1
INSERT INTO "authentication_tokens" ("auth_token", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["auth_token", "c7458d89714f252109a5cfd297ad36e8"], ["created_at", "2014-10-13 11:24:16.028687"], ["updated_at", "2014-10-13 11:24:16.028687"], ["user_id", 7]]
---
  def sing_in
    @valid_email = params[:email].present?
    @valid_password = params[:password].present?
    @user = User.authenticate_user_with_auth_token(params[:email],params[:password])
    if @user.present?
      @token = @user.authentication_tokens.build
      @token.save

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'mm1@gmail.com' LIMIT 1
---
  def forgot_password
  if params[:email].present?
    @user = User.find_by(email: params[:email])

UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 6  [["encrypted_password", "$2a$10$pK.RRvYK3AjAlwmLr/0jD.dKMks8pH467/1KhTQUc.tz3P2FaCz0y"], ["updated_at", "2014-10-13 11:20:41.654263"]]
---
  def change_password
    if params[:user][:current_password].present? && params[:user][:password].present?
      if @user.update_with_password(change_password_params)