app/controllers/api/v1/users_controller.rb

UPDATE "users" SET "email" = ?, "first_name" = ?, "last_name" = ?, "mobile_number" = ?, "updated_at" = ? WHERE "users"."id" = 10  [["email", "maan@gmail.com"], ["first_name", "m"], ["last_name", "m"], ["mobile_number", 1234567890], ["updated_at", "2014-10-13 13:31:19.202450"]]
---
  def update_profile
    if @user.update_attributes(update_params)